1.0.0 como fazer as importacoes e a conexao

In [10]:
from sqlite3.dbapi2 import connect
# abrir  o banco de dados
# importando a biblioteca sql3 e utilizando o as para fornecer um apelido
import sqlite3
 #importando a biblioteca pandas  e utilizando o as para fornecer um apelido

import pandas as pd
conn = sqlite3.connect("database.db")

1- exercicio

In [11]:
# ecercicio 1
# ligacao entre tabelas
consulta_atividade="""

  SELECT
    *
  FROM flight_activity fa LEFT JOIN flight_loyalty_history flh ON (fa.loyalty_number= flh. loyalty_number)





"""

# utilizando pandas para buscar e trazer a  consulta dentro do banco de dados utilizando sql misturando os dois DF quer dizer que é uma variavel tipo pandas
df_atividade = pd.read_sql_query(consulta_atividade, conn)
#aqui comando no pandas para trazer as 5 primeiras linhas
df_atividade.head()

,loyalty_number,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed,...,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month
0,100018,2017,1,3,0,3,1521,152.0,0,0,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
1,100102,2017,1,10,4,14,2030,203.0,0,0,...,College,NaN,Single,Nova,2887.74,Standard,2013,3,NaN,NaN
2,100140,2017,1,6,0,6,1200,120.0,0,0,...,College,NaN,Divorced,Nova,2838.07,Standard,2016,7,NaN,NaN
3,100214,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,63253.0,Married,Star,4170.57,Standard,2015,8,NaN,NaN
4,100272,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,91163.0,Divorced,Star,6622.05,Standard,2014,1,NaN,NaN

Segunda busca e unindo as tabelas

In [12]:
#ecercicio 2
consulta_atividade="""
  SELECT
    *
  FROM flight_loyalty_history





"""


df_atividade = pd.read_sql_query(consulta_atividade, conn)
df_atividade.head()

,loyalty_number,country,province,city,postal_code,gender,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [13]:
 #exercicio 3
consulta_atividade="""
  SELECT
  fa.loyalty_number,
    fa.year,
    fa.month,
    fa.flights_booked,
    fa.total_flights,
    fa.distance,
    fa.points_accumulated

  FROM
  flight_activity fa

  """
df_atividade = pd.read_sql_query(consulta_atividade, conn)
df_atividade.head()

,loyalty_number,year,month,flights_booked,total_flights,distance,points_accumulated
0,100018,2017,1,3,3,1521,152.0
1,100102,2017,1,10,14,2030,203.0
2,100140,2017,1,6,6,1200,120.0
3,100214,2017,1,0,0,0,0.0
4,100272,2017,1,0,0,0,0.0

In [15]:
#wxercicio 4
consulta_atividade="""
  SELECT
  fa.loyalty_number,
    fa.year,
    fa.month,
    fa.flights_booked,
    fa.total_flights,
    fa.distance,
    fa.points_accumulated

  FROM
  flight_activity fa

  WHERE
  fa.distance>2000 AND fa.month=9








  """
df_atividade = pd.read_sql_query(consulta_atividade, conn)
df_atividade.head()

,loyalty_number,year,month,flights_booked,total_flights,distance,points_accumulated
0,863070,2017,9,8,15,4245,424.0
1,691626,2018,9,8,15,4245,424.0
2,444931,2017,9,11,18,4428,442.0
3,409051,2018,9,11,18,4428,442.0
4,975387,2018,9,13,18,4428,442.0

3.0 INSPECIONANDO OS DADOS